package homework_06;

/*
Task 4
Дан следующий код. Вашей задачей является предсказать,
какой вывод будет напечатан в консоли после выполнения программы.

public class BooleanTest {
    public static void main(String[] args) {
        int a = 8;
        int b = 3;
        boolean result;

        result = (a + b) > 10; // Ответ true, т.к. 11 больше 10
        System.out.println("Result 1: " + result);

        result = (a - b) == 5; // Ответ true, т.к. 5 равно 5;
        System.out.println("Result 2: " + result);

        result = (a * b) != 24; // Ответ false, т.к. на самом неделе 24 равно 24
        System.out.println("Result 3: " + result);

        result = (a / b) >= 2; // Ответ true, т.к. (8/3 = 2 в целочисленном числе с дробной частью 0,66) равно 2

        System.out.println("Result 4: " + result);

        result = !(a % b == 2); // Ответ false, т.к. остаток 3х из 8ми будет 2 и результат в скобках на самом деле равен 2, а в выражении стоит отрицание
        System.out.println("Result 5: " + result);
    }
}
 */

public class Task_04 {

}
